In [ ]:
Part 1 (Basics, strings, lists, tuples, dictionaries)
1. Write a python function ‘convert’ to convert a python string to a python list of words: (4
marks)
example:
str = “ajit.singh@transorg.com” list = [‘ajit’,’singh’,’transorg’,’com’]

In [ ]:
question1

In [93]:
def convert(str):
    s1=str.split(".")
    #print(s1)
    s10=[]
    for i in s1:
        #print(i)
        if '@' not in i:
            s10.append(i)
    print(s10)
    s2=s1[1].split("@")
    print(s2)
    final=s10+s2
    print(final)

In [94]:
convert("ajit.singh@transorg.com")

['ajit', 'com']
['singh', 'transorg']
['ajit', 'com', 'singh', 'transorg']

In [ ]:
question2

In [95]:
def intersection(l1, l2):
    lst3 = [value for value in l1 if value in l2]
    return lst3
l1 = [1,2,3,4,5,6] 
l2 = [2,3,4,7,8]
print(intersection(l1, l2))

[2, 3, 4]

In [ ]:
question3

In [100]:
l1 = [1,2,2,1,3,4]
print("The list after conversion is : " ,(set(l1)))

The list after conversion is :  {1, 2, 3, 4}

In [ ]:
question4:

In [101]:
# list of numbers
l1= [100,101,102,103,104,105]

# sorting the list
l1.sort()
 
# printing the second last element
print("Second largest element is:", l1[-2])

Second largest element is: 104

In [ ]:
question5:

In [102]:
#5. Write a python code to generate a list of tuples from a dictionary. (2 marks)
d = {1:2,2:3,3:4}
list = []
for i in d:
    k = (i, d[i])
    list.append(k)
#Printing list
print(list)

[(1, 2), (2, 3), (3, 4)]

In [ ]:
#PART2

In [ ]:
Write a lambda function to square the elements in a list (1.5 marks)
l1= [1,2,3,4,5,6,7,8,9]

In [71]:
l1= [1,2,3,4,5,6,7,8,9]
print("Original list of integers:")
print(l1)
print("\nSquare every number of the said list:")
square_nums = list(map(lambda x: x ** 2, l1))
print(square_nums)

Original list of integers:
[1, 2, 3, 4, 5, 6, 7, 8, 9]

Square every number of the said list:
[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [ ]:
2. Write a lambda function to find the smaller value between two elements. (1.5 marks)
Example:
Input: 2,3
Output: 2

In [72]:
get_min = lambda a, b : min(a,b)
print(get_min(2,3))

2

In [ ]:
#Part#3

In [45]:
import pandas as pd
import numpy as np
dict1 = {'ID':[1,2,3,4,5],'Name':['Alpha','Bravo','Charlie','Delta','Echo']}
dict2 = {'ID':[2,2,5,3,1,1,4,4],
'Sport':['Cricket','Football','Basketball','Basketball','Table tennis','Cricket','Football','Basketball']}
dict3 = {'ID':[2,1,3,5,4], 'Marks':[30,' ',85,65,97]}
df1 = pd.DataFrame(data = dict1)
df2 = pd.DataFrame(data = dict2)
df3= pd.DataFrame(data = dict3)
df3['Marks']=np.where(df3['ID']==1,np.nan,df3['Marks'])

In [46]:
merged_df = df1.merge(df2, how="inner")

In [48]:
merged_df

   ID     Name         Sport
0   1    Alpha  Table tennis
1   1    Alpha       Cricket
2   2    Bravo       Cricket
3   2    Bravo      Football
4   3  Charlie    Basketball
5   4    Delta      Football
6   4    Delta    Basketball
7   5     Echo    Basketball

In [ ]:
2.Find the number of ID’s having marks greater than 80. Also, find the maximum and
minimum values of the column “Marks” in table 3.

In [49]:
df3

   ID Marks
0   2    30
1   1   NaN
2   3    85
3   5    65
4   4    97

In [60]:
df_mar=df3[df3['Marks']>80]

In [68]:
df_mar['ID']

2    3
4    4
Name: ID, dtype: int64